src/cf/Documents/уатАктПриемаПередачиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатАктПриемаПередачиТС</Name>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
				<xr:Item>Document.уатДТП</xr:Item>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатРезультатыОсмотраАгрегатовИЭлементов</xr:Item>
				<xr:Item>InformationRegister.уатКузовныеЭлементыТС</xr:Item>
				<xr:Item>AccumulationRegister.уатЭлементыКомплектации_уэ</xr:Item>
				<xr:Item>InformationRegister.уатАгрегатыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийАктПриемаПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСалонаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостоянияСалонаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеГрузовогоОтсекаПрицепа1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостоянияСалонаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеГрузовогоОтсекаПрицепа2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостоянияСалонаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсмотрПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктОсмотраТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатДТП</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюСалонаТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюГрузовогоОтсекаПрицепа1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюГрузовогоОтсекаПрицепа2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист1</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист2</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Агрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КузовныеЭлементы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КузовнойЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПовреждений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПовреждений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлементыКомплектации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПовреждений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПовреждений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПредыдущее</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПоврежденийПредыдущее</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПоврежденийПредыдущий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийАктПриемаПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийАктПриемаПередачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВодителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМеждуВодителями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Осмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйОсмотр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатАктПриемаПередачиТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ВидОперации       = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаВодителю;
		ТС                = ДанныеЗаполнения.ТранспортноеСредство;
		Принял            = ДанныеЗаполнения.Водитель1;
		ПутевойЛист2      = ДанныеЗаполнения;
		Одометр           = ДанныеЗаполнения.СпидометрВыезда;
		ДатаОсмотра       = ДанныеЗаполнения.ДатаВыезда;
		
		ОснТопливо = ТС.Модель.ОсновноеТопливо;
		мсвСтрокиПоиск = ДанныеЗаполнения.РасходГСМ.НайтиСтроки(Новый Структура("ТС, ГСМ", ТС, ОснТопливо));
		Если мсвСтрокиПоиск.Количество() > 0 Тогда
			ОстатокТоплива = мсвСтрокиПоиск[0].ОстатокПриВыезде;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатДТП") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ВидОперации       = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр;
		ТС                = ДанныеЗаполнения.ТС;
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.уатПутевойЛист")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
			ПутевойЛист1 = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПутевойЛист1) Тогда
			Одометр = ПутевойЛист1.СпидометрВозвращения;
			
			ОснТопливо = ТС.Модель.ОсновноеТопливо;
			мсвСтрокиПоиск = ПутевойЛист1.РасходГСМ.НайтиСтроки(Новый Структура("ТС, ГСМ", ТС, ОснТопливо));
			Если мсвСтрокиПоиск.Количество() > 0 Тогда
				ОстатокТоплива = мсвСтрокиПоиск[0].ОстатокПриВозвращении;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.КузовныеЭлементы Цикл
			Если ТекСтрока.НаличиеПовреждений Тогда
				НоваяСтрока						= КузовныеЭлементы.Добавить();
				НоваяСтрока.ТС		            = ДанныеЗаполнения.ТС;
				НоваяСтрока.КузовнойЭлемент		= ТекСтрока.КузовнойЭлемент;
				НоваяСтрока.Состояние 			= ТекСтрока.Состояние;
				НоваяСтрока.НаличиеПовреждений  = ТекСтрока.НаличиеПовреждений;
				НоваяСтрока.ХарактерПовреждений = ТекСтрока.ХарактерПовреждений;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаявкаНаРемонт") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ВидОперации       = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр;
		ТС                = ДанныеЗаполнения.ТС;
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.уатПутевойЛист")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование.ДокументОснование) Тогда
			ПутевойЛист1 = ДанныеЗаполнения.ДокументОснование.ДокументОснование;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПутевойЛист1) Тогда
			Одометр = ПутевойЛист1.СпидометрВозвращения;
			
			ОснТопливо = ТС.Модель.ОсновноеТопливо;
			мсвСтрокиПоиск = ПутевойЛист1.РасходГСМ.НайтиСтроки(Новый Структура("ТС, ГСМ", ТС, ОснТопливо));
			Если мсвСтрокиПоиск.Количество() > 0 Тогда
				ОстатокТоплива = мсвСтрокиПоиск[0].ОстатокПриВозвращении;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.КузовныеЭлементы Цикл
			Если ТекСтрока.НаличиеПовреждений Тогда
				НоваяСтрока						= КузовныеЭлементы.Добавить();
				НоваяСтрока.ТС		            = ДанныеЗаполнения.ТС;
				НоваяСтрока.КузовнойЭлемент		= ТекСтрока.КузовнойЭлемент;
				НоваяСтрока.Состояние 			= ТекСтрока.Состояние;
				НоваяСтрока.НаличиеПовреждений  = ТекСтрока.НаличиеПовреждений;
				НоваяСтрока.ХарактерПовреждений = ТекСтрока.ХарактерПовреждений;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.такАрендаТС") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ТС                = ДанныеЗаполнения.ТС;
		МодультакЗащищенныеФункцииСервер = ОбщегоНазначения.ОбщийМодуль("такЗащищенныеФункцииСервер");
		СозданныеДокументы = МодультакЗащищенныеФункцииСервер.СозданныеДокументыАктПриемаПередачиТСДляАренды(ДанныеЗаполнения); 
		Если СозданныеДокументы.ПередачаАрендатору <> Неопределено И СозданныеДокументы.ПриемОтАрендатора = Неопределено Тогда
			ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтАрендатора;
			
			ПунктОсмотраТС  = ДокументОснование.ПунктВозврата;
			ДатаОсмотра     = ?(ЗначениеЗаполнено(ДокументОснование.ДатаВозвратаФактическая), ДокументОснование.ДатаВозвратаФактическая,
				ДокументОснование.ДатаОкончанияПлановая);
			Одометр        = ДокументОснование.ОдометрВозврат;
			ОстатокТоплива = ДокументОснование.ОстатокТопливаВозврат;
		Иначе
			ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаАрендатору;
			
			ПунктОсмотраТС  = ДокументОснование.ПунктВыдачи;
			ДатаОсмотра     = ?(ЗначениеЗаполнено(ДокументОснование.ДатаВыдачиФактическая), ДокументОснование.ДатаВыдачиФактическая,
				ДокументОснование.ДатаНачалаПлановая);
			Одометр        = ДокументОснование.ОдометрВыдачи;
			ОстатокТоплива = ДокументОснование.ОстатокТопливаВыезд;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.уатАктПриемаПередачиТС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение.ОтразитьАгрегатыТС(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_проф.ОтразитьКузовныеЭлементыТС(ДополнительныеСвойства, Движения, Отказ);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ОМ_уатПроведение_уэ = ОбщегоНазначения.ОбщийМодуль("уатПроведение_уэ");
		ОМ_уатПроведение_уэ.ОтразитьЭлементыКомплектации(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	уатПроведение_проф.ОтразитьРезультатыОсмотраАгрегатовИЭлементов(ДополнительныеСвойства, Движения, Отказ);
		
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатАктПриемаПередачиТС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОсмотра = Неопределено;
	Шины.Очистить();
	Агрегаты.Очистить();
	КузовныеЭлементы.Очистить();
	ЭлементыКомплектации.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
